# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. Он задумывает два натуральных числа Y и Y (Y,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и
# их произведение P. Помогите Кате отгадать задуманные Петей числа.

# 4 4 -> 2 2
# 5 6 -> 2 3

X = abs(int(input('Введите натуральное число - границу диапазона ')))
S = abs(int(input(f'Введите Сумму загаданных чисел в диапазоне от 1 до {X}: ')))
P = abs(int(input(f'Введите Произведение загаданных чисел в диапазоне от 1 до {X}: ')))
if S < 1 or S > X or P < 1 or P > X:
    print('Вы ввели число не из заданного диапазона!')
else:
    Y = 0
    for i in range(X+1):
            if Y != 1:
                for j in range(X+1):
                    if Y != 1:
                        if i * j == P and i + j == S:
                            print(i, j)
                            Y = 1
            else:
                j = X
    else:
        i = X
